Repository: axant/tgapp-registration
Catalog: registration/i18n/*/LC_MESSAGES/registration.po
Languages: it

source: Please click on this link to confirm your registration
it: Clicca su questo link per confermare la tua registrazione

source: Please confirm your registration
it: Per favore conferma la tua registrazione

source: Registration not found or already activated
it: La tua richiesta di registrazione non è stata trovata o è già stata attivata

source: Username already activated
it: L'utente è già stato attivato

source: Account succesfully activated
it: Account attivato con successo

source: User Name
it: Nome Utente

source: Confirm Password
it: Conferma Password

source: Username already in use.
it: Il nome utente è già in uso.

source: Invalid username
it: Nome utente non valido

source: Email address has already been taken
it: Indirizzo email già in uso

source: Invalid email
it: Indirizzo email non valido

source: Registration Admin
it: Admin Registrazione

source: Date
it: Data

source: Username
it: Nome Utente

source: Activation Link
it: Link di Attivazione

source: activate
it: attiva

source: Registration Completed
it: Registrazione Completata

source: Registration completed
it: Registrazione completata

source: Congratulations, your registration has been completed.
it: Congratulazioni, la tua registrazione è stata completata.

source: An email
it: Una email

source: has been sent to
it: è stata inviata a

source: to activate the account, please proceed by clicking on the provided link to be able to login.
it: per attivare l'account, procedi clickando sul link fornito per poter effettuare il login.

source: Register New User
it: Registra un Nuovo Utente
